## Plan Result (prod_shutter_static_webapp)




<pre><code>Plan: 25 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;court-tribunal-hearings&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;pip-frontend&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;toffee&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;vh-admin-web&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;vh-video-web&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;court-tribunal-hearings&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;pip-frontend&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;toffee&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;vh-admin-web&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;vh-video-web&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;court-tribunal-hearings&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;pip-frontend&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;toffee&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;vh-admin-web&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;vh-video-web&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;court-tribunal-hearings&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;pip-frontend&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;toffee&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;vh-admin-web&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;vh-video-web&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;court-tribunal-hearings&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;pip-frontend&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;toffee&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;vh-admin-web&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;vh-video-web&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.static_webapp.azurerm_dns_cname_record.cname_record["court-tribunal-hearings"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "court-tribunal-hearings.service.gov.uk"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["pip-frontend"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "pip-frontend-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["toffee"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "toffee-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["vh-admin-web"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "admin-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "hearings.reform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["vh-video-web"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "video-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "hearings.reform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["court-tribunal-hearings"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.www"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "court-tribunal-hearings.service.gov.uk"

      + record {
          + value = (known after apply)
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["pip-frontend"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.pip-frontend"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"

      + record {
          + value = (known after apply)
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["toffee"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.toffee"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"

      + record {
          + value = (known after apply)
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["vh-admin-web"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.admin"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "hearings.reform.hmcts.net"

      + record {
          + value = (known after apply)
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["vh-video-web"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.video"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "hearings.reform.hmcts.net"

      + record {
          + value = (known after apply)
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["court-tribunal-hearings"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "court-tribunal-hearings"
      + resource_group_name = "sds-platform-shutter-webapp-prod-rg"
      + sku_size            = "Free"
      + sku_tier            = "Free"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["pip-frontend"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "pip-frontend"
      + resource_group_name = "sds-platform-shutter-webapp-prod-rg"
      + sku_size            = "Free"
      + sku_tier            = "Free"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["toffee"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "toffee"
      + resource_group_name = "sds-platform-shutter-webapp-prod-rg"
      + sku_size            = "Free"
      + sku_tier            = "Free"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["vh-admin-web"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "vh-admin-web"
      + resource_group_name = "sds-platform-shutter-webapp-prod-rg"
      + sku_size            = "Free"
      + sku_tier            = "Free"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["vh-video-web"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "vh-video-web"
      + resource_group_name = "sds-platform-shutter-webapp-prod-rg"
      + sku_size            = "Free"
      + sku_tier            = "Free"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["court-tribunal-hearings"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "www.court-tribunal-hearings.service.gov.uk"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["pip-frontend"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "pip-frontend.platform.hmcts.net"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["toffee"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "toffee.platform.hmcts.net"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["vh-admin-web"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "admin.hearings.reform.hmcts.net"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["vh-video-web"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "video.hearings.reform.hmcts.net"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.github_actions_secret.secret["court-tribunal-hearings"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "court_tribunal_hearings_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["pip-frontend"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "pip_frontend_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["toffee"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "toffee_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["vh-admin-web"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "vh_admin_web_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["vh-video-web"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "vh_video_web_prod"
      + updated_at      = (known after apply)
    }

Plan: 25 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":483,"Program":"tfcmt","SHA1":"","Target":"prod_shutter_static_webapp","Vars":{}} -->